#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-JZgZMmchPxA3aU8s

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Initializing plugins and modules...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
random_password.db_password: Refreshing state... [id=none]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_sso_api_swagger.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-api-swagger]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:220881534007:certificate/399165e3-6c0b-4264-940c-3a960e4b86b0]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_resource.openapi_swagger: Refreshing state... [id=nnz32f]
aws_api_gateway_resource.api: Refreshing state... [id=9jt82m]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_api_gateway_resource.app: Refreshing state... [id=l8dcc6]
aws_api_gateway_resource.swagger_assets_proxy: Refreshing state... [id=183flk]
aws_api_gateway_resource.openapi_swagger_proxy: Refreshing state... [id=3ofha9]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_resource.api_proxy: Refreshing state... [id=uysksd]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cmapde]
aws_api_gateway_method.swagger_assets_proxy: Refreshing state... [id=agm-gcp9dahm4c-183flk-GET]
aws_apigatewayv2_domain_name.this: Refreshing state... [id=api-dev.loginproxy.gov.bc.ca]
aws_api_gateway_method.openapi_swagger_proxy: Refreshing state... [id=agm-gcp9dahm4c-3ofha9-GET]
aws_api_gateway_method.api_proxy: Refreshing state... [id=agm-gcp9dahm4c-uysksd-ANY]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-gcp9dahm4c-cmapde-ANY]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
aws_api_gateway_method_response.openapi_swagger_proxy: Refreshing state... [id=agmr-gcp9dahm4c-3ofha9-GET-200]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_api_gateway_method_response.swagger_assets_proxy: Refreshing state... [id=agmr-gcp9dahm4c-183flk-GET-200]
module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=xgr00q-dev-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-api-swagger,private]
module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-api-swagger]
aws_s3_object.swagger_dist["README.md"]: Refreshing state... [id=README.md]
aws_s3_object.swagger_dist["swagger-ui-bundle.js"]: Refreshing state... [id=swagger-ui-bundle.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"]: Refreshing state... [id=swagger-ui-es-bundle.js]
aws_s3_object.swagger_dist["oauth2-redirect.html"]: Refreshing state... [id=oauth2-redirect.html]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"]: Refreshing state... [id=swagger-ui-es-bundle-core.js]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"]: Refreshing state... [id=swagger-ui-standalone-preset.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"]: Refreshing state... [id=swagger-ui-es-bundle-core.js.map]
aws_s3_object.swagger_dist["absolute-path.js"]: Refreshing state... [id=absolute-path.js]
aws_s3_object.swagger_dist["LICENSE"]: Refreshing state... [id=LICENSE]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"]: Refreshing state... [id=swagger-ui-es-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui.css"]: Refreshing state... [id=swagger-ui.css]
aws_s3_object.swagger_dist["index.js"]: Refreshing state... [id=index.js]
aws_s3_object.swagger_dist["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.swagger_dist["index.css"]: Refreshing state... [id=index.css]
aws_s3_object.swagger_dist["swagger-initializer.js"]: Refreshing state... [id=swagger-initializer.js]
aws_s3_object.swagger_dist["package.json"]: Refreshing state... [id=package.json]
aws_s3_object.swagger_dist["swagger-output.json"]: Refreshing state... [id=swagger-output.json]
aws_s3_object.swagger_dist["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
aws_s3_object.swagger_dist["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
aws_s3_object.swagger_dist["swagger-ui.js.map"]: Refreshing state... [id=swagger-ui.js.map]
aws_s3_object.swagger_dist["NOTICE"]: Refreshing state... [id=NOTICE]
aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"]: Refreshing state... [id=swagger-ui-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui.css.map"]: Refreshing state... [id=swagger-ui.css.map]
aws_s3_object.swagger_dist["swagger-ui.js"]: Refreshing state... [id=swagger-ui.js]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"]: Refreshing state... [id=swagger-ui-standalone-preset.js.map]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-keycloak,private]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=xgr00q-dev-keycloak]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210817012201712900000001]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
aws_apigatewayv2_api_mapping.this: Refreshing state... [id=zfeccr]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.css_api: Refreshing state... [id=lambda-css-api]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-cmapde-ANY]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_lambda_permission.apigw_api: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.api: Refreshing state... [id=agi-gcp9dahm4c-uysksd-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=bsp54p]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.s3_sso_api_swagger.aws_s3_bucket_server_side_encryption_configuration.this has been changed
  ~ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
        id     = "xgr00q-dev-api-swagger"
        # (1 unchanged attribute hidden)

      + rule {
          + bucket_key_enabled = false

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
      - rule {
          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
    }
  # module.s3_sso_api_swagger.aws_s3_bucket.this has been changed
  ~ resource "aws_s3_bucket" "this" {
        id                          = "xgr00q-dev-api-swagger"
      + tags                        = {}
        # (10 unchanged attributes hidden)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }


      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

        # (2 unchanged blocks hidden)
    }
  # aws_api_gateway_method.swagger_assets_proxy has been changed
  ~ resource "aws_api_gateway_method" "swagger_assets_proxy" {
      + authorization_scopes = []
        id                   = "agm-gcp9dahm4c-183flk-GET"
      + request_models       = {}
        # (6 unchanged attributes hidden)
    }
  # aws_api_gateway_method_response.swagger_assets_proxy has been changed
  ~ resource "aws_api_gateway_method_response" "swagger_assets_proxy" {
        id                  = "agmr-gcp9dahm4c-183flk-GET-200"
      + response_models     = {}
        # (5 unchanged attributes hidden)
    }
  # aws_api_gateway_method.openapi_swagger_proxy has been changed
  ~ resource "aws_api_gateway_method" "openapi_swagger_proxy" {
      + authorization_scopes = []
        id                   = "agm-gcp9dahm4c-3ofha9-GET"
      + request_models       = {}
        # (6 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "swagger-ui-es-bundle-core.js"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["LICENSE"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "LICENSE"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["favicon-16x16.png"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "favicon-16x16.png"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["package.json"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "package.json"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["oauth2-redirect.html"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "oauth2-redirect.html"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-ui.css.map"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "swagger-ui.css.map"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                 = "swagger-ui-standalone-preset.js.map"
      + metadata           = {}
      + tags               = {}
        # (10 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["NOTICE"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "NOTICE"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "swagger-ui-es-bundle.js.map"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "swagger-ui-standalone-preset.js"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-ui.css"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "swagger-ui.css"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["README.md"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "README.md"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "swagger-ui-bundle.js.map"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-output.json"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "swagger-output.json"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["absolute-path.js"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "absolute-path.js"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["index.html"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "index.html"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "swagger-ui-es-bundle.js"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["index.js"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "index.js"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "swagger-ui-es-bundle-core.js.map"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-initializer.js"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "swagger-initializer.js"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["favicon-32x32.png"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "favicon-32x32.png"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-ui.js.map"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "swagger-ui.js.map"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-ui.js"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "swagger-ui.js"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["swagger-ui-bundle.js"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "swagger-ui-bundle.js"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_s3_object.swagger_dist["index.css"] has been changed
  ~ resource "aws_s3_object" "swagger_dist" {
        id                     = "index.css"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }
  # aws_api_gateway_method_response.openapi_swagger_proxy has been changed
  ~ resource "aws_api_gateway_method_response" "openapi_swagger_proxy" {
        id                  = "agmr-gcp9dahm4c-3ofha9-GET-200"
      + response_models     = {}
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-08-23T23:04:44.608Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2022-08-18T21:11:07Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:220881534007:gcp9dahm4c/test" -> (known after apply)
      ~ id            = "bsp54p" -> (known after apply)
      ~ invoke_url    = "https://gcp9dahm4c.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "ed728b6bc71158b20d0452d1fbe1b895f15d4bb9"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.openapi_swagger will be created
  + resource "aws_api_gateway_integration" "openapi_swagger" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = (known after apply)
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + request_parameters      = {
          + "integration.request.header.Content-Disposition" = "method.request.header.Content-Disposition"
          + "integration.request.header.Content-Type"        = "method.request.header.Content-Type"
        }
      + resource_id             = "3ofha9"
      + rest_api_id             = "gcp9dahm4c"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:s3:::xgr00q-dev-api-swagger/index.html"
    }

  # aws_api_gateway_integration.openapi_swagger_assets will be created
  + resource "aws_api_gateway_integration" "openapi_swagger_assets" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = (known after apply)
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + request_parameters      = {
          + "integration.request.header.Content-Disposition" = "method.request.header.Content-Disposition"
          + "integration.request.header.Content-Type"        = "method.request.header.Content-Type"
          + "integration.request.path.asset"                 = "method.request.path.asset"
        }
      + resource_id             = "183flk"
      + rest_api_id             = "gcp9dahm4c"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:s3:::xgr00q-dev-api-swagger/*"
    }

  # aws_api_gateway_integration_response.openapi_swagger will be created
  + resource "aws_api_gateway_integration_response" "openapi_swagger" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "3ofha9"
      + response_parameters = {
          + "method.response.header.Content-Disposition" = "integration.response.header.Content-Disposition"
          + "method.response.header.Content-Type"        = "integration.response.header.Content-Type"
        }
      + rest_api_id         = "gcp9dahm4c"
      + status_code         = "200"
    }

  # aws_api_gateway_integration_response.openapi_swagger_assets will be created
  + resource "aws_api_gateway_integration_response" "openapi_swagger_assets" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "183flk"
      + response_parameters = {
          + "method.response.header.Content-Disposition" = "integration.response.header.Content-Disposition"
          + "method.response.header.Content-Type"        = "integration.response.header.Content-Type"
        }
      + rest_api_id         = "gcp9dahm4c"
      + status_code         = "200"
    }

  # aws_iam_role.s3_read_access_role will be created
  + resource "aws_iam_role" "s3_read_access_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:List*",
                          + "s3:Get*",
                          + "s3-object-lambda:List*",
                          + "s3-object-lambda:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ApiGatewayAmazonS3ReadOnlyAccess"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-08-23T23:04:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "9vXonJoc/4czRcxQdGdW+yQwTbcL59S/rapZpxPv6yI=" -> "x4vvKplTgdOMzFn4Pa/wCsYR3XKeFX6Xet5VC2pGVnQ="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-08-23T23:04:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "mUB1qsDfiSvhnWFGF1Baaos5fgtYluxhSuaHbOmSuWQ=" -> "DfZHLwx91oL+bKbROiBMcbTYF7jpeI1JbYZGmlVhP7c="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be updated in-place
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2022-08-23T23:04:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "0+kNqiJKco/eGH1zJLJCH5nKlfH8Kz9yXe0u+WT/TDo=" -> "MRRg9iTphAHiUe6IJTLEVI9SWSazEbfB3LTGChswMSU="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-08-23T23:04:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "+vcV+Uq9iCNiQYmvxTLSwT9kGJS1aD7IJK3nEGc3Hu4=" -> "q5D3uwuUcQhGejuStZtEc0Q26VPVgaKIoCnZzQ3IBFw="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-08-23T23:04:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "rlpHexPww3OCblvGUUewJdx9Vc9YSQHVTR+5W6bNbQU=" -> "YP0wGh9+9W9Unl1IhbpYeQ/w/87jRUU6S5xgXyDNnf8="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

Plan: 6 to add, 5 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url     = "https://gcp9dahm4c.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-08-23T23:04:44.608Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 36 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @NithinKuruba, Action: `pull_request`*